# features of pandas-
1) Import dataset, Example- .csv Excel
2)  Data cleaning-  missing values and invalid values
3)  size mutability(Add or delete columns and rows)
4)  Reshaping and piovting (piovit table)
5)  Efficient, manupulation,extraction
6)  Stastical analysis

- Series--
    It is a collection which looks like 1d array

In [9]:
# import essential libraries
import numpy as np
import pandas as pd

In [10]:
df = pd.Series([22,33,55,77],name='Age')
df

0    22
1    33
2    55
3    77
Name: Age, dtype: int64

- Differnce between array and series-

  1) Array-
     1) Array belongs to numpy
     2) string/objects
     3) It display only data
  - Syntax -
        - np.array(coll)
    
  2) Series-
    1) Series belongs to pandas
    2) complex/objects
    3) It display data,index,datatype
  - syntax-
        - pd.series(coll)

    - var = pd.Series([val1,val2,...,valn],name='col_name')
    -

In [12]:
s = pd.Series([22,33,55,77],name='Age')
df=s.to_frame()
df

   Age
0   22
1   33
2   55
3   77

- syntax --    df.values
 
- It will written the values

single iloc-
 - It will return the values present at particular index
-syntax-
   - var.iloc[index,index,---index]
  
- NOte

In [13]:
a = np.arange(1,15)
a

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

In [14]:
import pandas as pd
s= pd.Series(a)
s

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
dtype: int64

In [15]:
print(s.iloc[3])

4

In [16]:
print(s.iloc[1:12])

1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
dtype: int64

- loc  - It is use to fetch multiple values present of index.

In [17]:
df.loc[2]

Age    55
Name: 2, dtype: int64

In [18]:
d = {'apple':110,'banana':40,'mango':20,'grapes':100,'kivi':12}
d = pd.Series(d,name='Prices')

df=d.to_frame()
df

        Prices
apple      110
banana      40
mango       20
grapes     100
kivi        12

In [19]:
print(d.iloc[3])

100

In [20]:
d[d>100]

apple    110
Name: Prices, dtype: int64

In [21]:
d[(d>30)&(d<50)]

banana    40
Name: Prices, dtype: int64

In [22]:
d[d!=20]

apple     110
banana     40
grapes    100
kivi       12
Name: Prices, dtype: int64

In [23]:
d[~(d>20)]

mango    20
kivi     12
Name: Prices, dtype: int64

#  Data frame-
It is a collection of 2d array collection of series , collection of row and columnns
-Syntax-
       - var = pd. Dataframe(dict)

In [24]:
b = {'Sname':['Aman','Suraj','anuj','arpit','suyash'],
     'Sid':[101,102,103,104,105],
      'Sal':[1232,4577,3144,5354,4566]}
df = pd.DataFrame(b)
df

    Sname  Sid   Sal
0    Aman  101  1232
1   Suraj  102  4577
2    anuj  103  3144
3   arpit  104  5354
4  suyash  105  4566

In [25]:
df[1:3]

   Sname  Sid   Sal
1  Suraj  102  4577
2   anuj  103  3144

In [26]:
df.iloc[1,1]

np.int64(102)

In [27]:
df[['Sal','Sid']]

    Sal  Sid
0  1232  101
1  4577  102
2  3144  103
3  5354  104
4  4566  105

# Note-
- We can apply slicing on dataframe but we can not apply indexing on dataframe
- we can fetch columns or multiple column at a time.
- syntax
- var['col_name]
- var[['col_name','col_name"----]
- we can applay indexing on particular single column of dataframe
- Syntax
- var['col_name'][index]
-

In [28]:
df['Sal']

0    1232
1    4577
2    3144
3    5354
4    4566
Name: Sal, dtype: int64

In [29]:
df['Sal'][3]

np.int64(5354)

In [30]:
df['Sal'][3]=8787
df

C:\Users\hp\AppData\Local\Temp\ipykernel_18716\3840483877.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Sal'][3]=8787

    Sname  Sid   Sal
0    Aman  101  1232
1   Suraj  102  4577
2    anuj  103  3144
3   arpit  104  8787
4  suyash  105  4566

In [31]:
df['City']='Lucknow','Noida','Panjab','jaunpur','Delhi'
df

    Sname  Sid   Sal     City
0    Aman  101  1232  Lucknow
1   Suraj  102  4577    Noida
2    anuj  103  3144   Panjab
3   arpit  104  8787  jaunpur
4  suyash  105  4566    Delhi

In [32]:
df['Bonus']=[1111,1112,1113,1114,1115]
df

    Sname  Sid   Sal     City  Bonus
0    Aman  101  1232  Lucknow   1111
1   Suraj  102  4577    Noida   1112
2    anuj  103  3144   Panjab   1113
3   arpit  104  8787  jaunpur   1114
4  suyash  105  4566    Delhi   1115

In [33]:
df = pd.read_csv("https://raw.githubusercontent.com/Taj1920/Data-Analysis-Datasets/refs/heads/main/Datasets-Practice/hr_data.csv")